/*
Дан массив:

let arr = [2, 5, 9, 3, 1, 4];
Найдите сумму элементов этого массива.
 */

let arr = [2, 5, 9, 3, 1, 4];
let res = 0;

for(let element of arr) {
    res += element;
}
console.log(res); //24

//----------------------------------------

/*
Дан массив:

let arr = [2, 5, 9, 3, 1, 4];
Найдите сумму элементов, являющихся четными числами.
 */

let res1 = 0;

for( let i = 0 ; i < arr.length ; i++){
    if(arr[i] % 2 === 0){
        res1 += arr[i];
    }
}
console.log(res1); //6


//-------------------

/*
Дан массив:

let arr = [2, 5, 9, 3, 1, 4];
Найдите сумму квадратов элементов этого массива.
 */


let res2 = 0;
for( let i = 0 ; i < arr.length ; i++){
    arr[i] = arr[i] * arr[i]; //4 25 81 9 1 16
    res2 += arr[i];

}

console.log(res2); //136

//-----------------------------------------

/*
Дан массив:

let arr = [2, 5, 9, 3, 1, 4];
Найдите произведение элементов этого массива.
 */

let res3 = 0;
for( let i = 0 ; i < arr.length ; i++){
    res3 *= arr[i];
}
console.log(res3);

//-----------------------------------




