//Найдите сумму четных чисел от 2 до 100.

let a = 0;
for( let i = 0; i < 100; i++ ) {

    if(i % 2 === 0){
        a += i;
        console.log(i);
    }

}
console.log(a);

//--------------------------------------


//Найдите сумму нечетных чисел от 1 до 99.

let b = 0;
for( let i = 0; i < 100; i++ ) {

    if(i % 2 !== 0){
        b += i;
        console.log(i);
    }

}
console.log(b);

//--------------------------------------

//Найдите произведение целых чисел от 1 до 20.

let c = 1;
for( let i = 1; i < 20; i++ ) {
    c *= i;
}
console.log(c);