//Используя цикл и метод push заполните массив числами от 1 до 10.

let arr = [];

for (let i = 1; i <= 10; i++){
    arr.push(i);
}
console.log(arr)   //[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

//----------------------------------------

//Используя цикл и метод push заполните массив 10-ю буквами 'x'.

let arr0 = [];

for (let i = 1; i <= 10; i++){
    arr0.push('x');
}
console.log(arr0)   //['x', 'x', 'x', 'x','x', 'x', 'x', 'x', 'x', 'x']


//-----------------------------------------

//Дан массив с числами. Переберите его циклом и запишите в новый массив только положительные из чисел.

let arr1 = [-2, -9, 6, 0, -5, 7, 6, -7];
let arr2 = [];

for (let i = 1; i < arr1.length; i++){
    if( arr1[i] >= 0 ) {
        arr2.push(arr1[i]);
    }
}

console.log(arr2);  //[ 6, 0, 7, 6 ]

//-----------------------------------------


