//С помощью цикла сформируйте строку, заполненную 5-тью дефисами.

let def = ''
for(let i = 0; i < 5; i++ ) {
    def += '-';
}
console.log(def)   // '-----'

//---------------------------


//С помощью цикла сформируйте строку '123456789'.

let sum = ''
for(let i = 1; i < 10; i++){
    sum += i;
}
console.log(sum) // '123456789'

//--------------------------------------



//С помощью цикла сформируйте строку '987654321'.

let summary = '';
for(let i = 9; i > 0; i--){
    summary += i;
}

console.log(summary)

//----------------------------------------------


//С помощью цикла сформируйте строку '-1-2-3-4-5-6-7-8-9-'.

let res4 = '-';

for( let i = 1 ; i < 10; i++){

    res4 += i+'-';
}
console.log(res4)