//Выведите в консоль числа от 1 до 100.
let num = 0;
while (num<100){
    num++;
    console.log(num);
}

//-----------------------------------------


//Выведите в консоль числа от 11 до 33.

let num1 = 11;

while(num1<33){
    num1++;
    console.log(num1);
}

//------------------------------------------


//Дано число num с неким начальным значением. Умножайте его на 3 столько раз, пока результат умножения не станет больше 1000. Какое число получится? Посчитайте количество итераций, необходимых для это

let i = 7;
iterationCount = 0;
while(i<1000){
    i = i * 3;
    iterationCount++;

}

console.log(i);
console.log(iterationCount);

//----------------------------------------------